import 'model.dart';

List<Product> Products = [
  Product(
    id: 1,
    price: 1000,
    title: "سماعات لاساكيه",
    subtitle: "",
    image: "images/AirPods2.jpeg",
    description:
        "السماعات اللاسلكية هي أجهزة صوت تستخدم تقنية البلوتوث أو الواي فاي  لاستقبال الصوت من جهاز مصدر الصوت مثل الهاتف الذكي أو الكمبيوتر اللوحي دون الحاجة إلى توصيل كابل ",
  ),
  Product(
    id: 2,
    price: 5000,
    title: "جهاز موبايل",
    subtitle: "",
    image: "images/mobile.jpeg",
    description:
        "هو جهاز محمول متعدد الاستخدامات يجمع بين وظائف الهاتف الخلوي وحاسب لوحي صغير. يتميز بشاشة تعمل باللمس والقدرة على الاتصال بشبكات الإنترنت والقيام بالعديد من المهام والتطبيقات المختلفة",
  ),
  Product(
    id: 3,
    price: 600,
    title: "سماعات",
    subtitle: "",
    image: "images/listening.jpeg",
    description:
        "تُعتبر السماعات من الأجهزة الإلكترونية الأساسية التي تُستخدم لتحسين تجربة الاستماع للموسيقى",
  ),
  Product(
    id: 4,
    price: 4000,
    title: "نظارات ثلاثيه الابعاد",
    subtitle: "",
    image: "images/image 3D.jpeg",
    description:
        "نظارات ثلاثية الأبعاد (3D) هي نوع من النظارات المصممة لإنشاء إحساس بالبعد الثالث (العمق) عند مشاهدة محتوى ثلاثي الأبعاد. هذا يخلق تجربة مشاهدة ممتعة وواقعية للمستخدم",
  ),
  Product(
    id: 5,
    price: 3000,
    title: "كاميرات كمبيوتر",
    subtitle: "",
    image: "images/camercomputer.jpeg",
    description:
        "كاميرات الكمبيوتر هي أجهزة استشعار رقمية مصممة لالتقاط الصور والفيديو وإرسالها إلى الكمبيوتر ",
  ),
  Product(
    id: 6,
    price: 2000,
    title: "مسجل صوت",
    subtitle: "",
    image: "images/recored.jpeg",
    description:
        "مسجل الصوت هو جهاز إلكتروني مصمم لتسجيل وتخزين الصوت الرقمي. يُستخدم على نطاق واسع",
  ),
  Product(
    id: 7,
    price: 15000,
    title: "جهاز لابتوب",
    subtitle: "",
    image: "images/laptop.jpeg",
    description:
        "الكمبيوتر المحمول أو اللابتوب هو جهاز كمبيوتر محمول صغير الحجم مصمم للاستخدام المتنقل. يتميز بالآتي: الحجم والوزن: هو جهاز صغير وخفيف الوزن يمكن حمله بسهولةالشاشة والمدخلات: يأتي مع شاشة LCD ولوحة مفاتيح مدمجة وإما لوحة تحكم باللمس أو ماوس",
  ),
  Product(
    id: 8,
    price: 30000,
    title: "التلفزيون",
    subtitle: "",
    image: "images/Tv.jpeg",
    description:
        "التلفزيون (TV) هو جهاز إلكتروني مستطيل الشكل يستخدم لعرض الصور المتحركة والصوت. وهو من أكثر الأجهزة الإلكترونية انتشارًا في المنازل والأماكن العامة. تتميز أجهزة التلفزيون بالخصائص الرئيسية",
  ),
  Product(
    id: 9,
    price: 1500,
    title: "جهاز الباور بانك ",
    subtitle: "",
    image: "images/power.jpeg",
    description:
        "الباور بانك (Power Bank) هو جهاز محمول وقابل للشحن يستخدم لشحن الأجهزة الإلكترونية المحمولة مثل الهواتف الذكية والأجهزة اللوحية والكاميرات وغيرها. يتميز هذا الجهاز بالخصائص الرئيسية التالية:السعة: تأتي الباور بانكات بسعات بطارية مختلفة تبدأ من 5,000 ملي أمبير إلى 20,000 ملي أمبير أو أكثر",
  ),
  Product(
    id: 10,
    price: 2000,
    title: "كيبورد وماوس",
    subtitle: "",
    image: "images/mouse and kayboard.jpeg",
    description:
        "الكيبورد (Keyboard) والماوس (Mouse) هما أجهزة إدخال رئيسية تستخدم مع الحاسوب لإدخال البيانات والتفاعل معه. ويتميزان بالخصائص الرئيسية التالية: الاتصال: يتوفر بالاتصال السلكي أو اللاسلكي عبر تقنيات كالبلوتوث أو الراديو",
  ),
  Product(
    id: 11,
    price: 1000,
    title: "طابعات",
    subtitle: "",
    image: "images/Printer.jpeg",
    description:
        " الطابعات (Printers) هي أجهزة إخراج رئيسية تستخدم مع الحاسوب لإنتاج مطبوعات ورقية. وتتميز",
  ),
  Product(
    id: 12,
    price: 1300,
    title: "جهاز التحكم",
    subtitle: "",
    image: "images/control.jpeg",
    description:
        " هي أجهزة إلكترونية مصممة للتحكم والسيطرة على أنظمة أخرى وتتميز ب المعالجة والتحكم: البرمجة والتكيف و  ",
  ),
];
